환경 설정

In [4]:
import pandas as pd

In [2]:
menu = pd.Series(["비빔밥", " 김치찌개" , "된장찌개"])
menu

0      비빔밥
1     김치찌개
2     된장찌개
dtype: object

In [3]:
price = pd.Series([10000,9000,8000])

In [4]:
price

0    10000
1     9000
2     8000
dtype: int64

### 데이터 프래임 만들기

In [8]:
dfs = pd.DataFrame({
    "메뉴" : menu,
    "가격" : price
})
dfs

      메뉴     가격
0    비빔밥  10000
1   김치찌개   9000
2   된장찌개   8000

In [5]:
df = pd.DataFrame({
    "메뉴": ["비빔밥" , "김치찌개" ,"된장"] ,
    "가격" : [10000,9000,8000],
    "원산지" : ["국내" , "국내" ,"국내"]
})
df

     메뉴     가격 원산지
0   비빔밥  10000  국내
1  김치찌개   9000  국내
2    된장   8000  국내

컬럼선택

컬럼선택

In [12]:
ms = df["메뉴"]
display(ms, type(ms))

0     비빔밥
1    김치찌개
2      된장
Name: 메뉴, dtype: object

pandas.core.series.Series

단일 칼럼을 데이터 프레임으로

In [14]:
ms_df = df[["메뉴"]]
ms_df

     메뉴
0   비빔밥
1  김치찌개
2    된장

In [15]:
mpdf = df[["메뉴" ,"가격"]]
mpdf

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2    된장   8000

In [16]:
cols = ["메뉴" , "가격"]
mpdf2 = df[cols]
mpdf2

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2    된장   8000

레이블 기반 행 선택 (loc)

In [17]:
row0 = df.loc[0]
rows_0_to_1 = df.loc[0:1]
rows_price_9000 = df.loc[df["가격"] >= 9000, ["메뉴","가격"]]
display(row0 ,rows_0_to_1,rows_price_9000)

메뉴       비빔밥
가격     10000
원산지       국내
Name: 0, dtype: object

     메뉴     가격 원산지
0   비빔밥  10000  국내
1  김치찌개   9000  국내

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000

정수 위치 기반(iloc)

In [18]:
r = df.iloc[0]
sub = df.iloc[0:2,0:2]
display(r,sub)

메뉴       비빔밥
가격     10000
원산지       국내
Name: 0, dtype: object

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000

In [34]:
type(df)

pandas.core.frame.DataFrame

컬럼 추가/수정/삭제

In [20]:
df["할인가"] = (df["가격"] * 0.9).astype(int)

In [35]:
type(df)

pandas.core.frame.DataFrame

In [28]:
type(df)

int

In [29]:
df = pd.DataFrame({
    "메뉴": ["비빔밥" , "김치찌개" ,"된장"] ,
    "가격" : [10000,9000,8000],
    "원산지" : ["국내" , "국내" ,"국내"]
})
df

     메뉴     가격 원산지
0   비빔밥  10000  국내
1  김치찌개   9000  국내
2    된장   8000  국내

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
# 예: 10% 할인 가격 컬럼 추가
df['할인가'] = (df['가격'] * 0.9).astype(int)

In [33]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df

     메뉴     가격 원산지   할인가
0   비빔밥  10000  국내  9000
1  김치찌개   9000  국내  8100
2    된장   8000  국내  7200

In [37]:
type(df)

pandas.core.frame.DataFrame

In [38]:
df.loc[df["메뉴"] == "김치찌개" , "가격"] = 9500

In [39]:
type(df)

pandas.core.frame.DataFrame

In [40]:
df

     메뉴     가격 원산지   할인가
0   비빔밥  10000  국내  9000
1  김치찌개   9500  국내  8100
2    된장   8000  국내  7200

In [43]:
df = df.drop(columns=["할인가"])

In [44]:
df

     메뉴     가격 원산지
0   비빔밥  10000  국내
1  김치찌개   9500  국내
2    된장   8000  국내

In [8]:
# 가격 오름차순
df_sorted_asc = df.sort_values(by='가격', ascending=True)

# 가격 내림차순
df_sorted_desc = df.sort_values(by='가격', ascending=False)

In [9]:
display(df_sorted_asc , df_sorted_desc)

     메뉴     가격 원산지
2    된장   8000  국내
1  김치찌개   9000  국내
0   비빔밥  10000  국내

     메뉴     가격 원산지
0   비빔밥  10000  국내
1  김치찌개   9000  국내
2    된장   8000  국내

In [49]:
# 원산지가 국내산이면서 가격이 9000 이상
filtered = df[(df['원산지'] == '국내') & (df['가격'] >= 9000)]
filtered

     메뉴     가격 원산지
0   비빔밥  10000  국내
1  김치찌개   9500  국내

In [50]:
# 컬럼명 일괄 변경 예시
df_renamed = df.rename(columns={'메뉴': 'menu', '가격': 'price', '원산지': 'origin'})
df_renamed

   menu  price origin
0   비빔밥  10000     국내
1  김치찌개   9500     국내
2    된장   8000     국내

문제풀기

In [53]:
import pandas as pd

In [51]:
fruits = pd.Series(["사과","바나나" , "포도"])

In [52]:
fruits

0     사과
1    바나나
2     포도
dtype: object

In [55]:
df = pd.DataFrame({
    "상품" : ["키보드" , "마우스" ," 모니터"],
    "가격" : [30000,1500,20000],
    "재고" : [10,25,7]
})
df

     상품     가격  재고
0   키보드  30000  10
1   마우스   1500  25
2   모니터  20000   7

In [56]:
prod_s = df.loc[0]

In [57]:
prod_s

상품      키보드
가격    30000
재고       10
Name: 0, dtype: object

In [58]:
prod_s = df["상품"]
prod_df = df[["상품"]]

In [59]:
display(prod_s , prod_df)

0     키보드
1     마우스
2     모니터
Name: 상품, dtype: object

     상품
0   키보드
1   마우스
2   모니터

In [62]:
price_view = df[["상품", "가격"]]
price_view

     상품     가격
0   키보드  30000
1   마우스   1500
2   모니터  20000

In [64]:
expensive = df.loc[df["가격"] >=2000 , ["상품"]]
expensive

     상품
0   키보드
2   모니터